app/controllers/movies_controller.rb


  #I bet this could be cut down to 3-4 lines if I did more reading on ActiveRecord. :/
    if filters.empty?
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date

        if filters[:ratings].nil?
          @movies = Movie.find(:all, :order => filters[:order])
        else
          @movies = Movie.find(:all, :order => filters[:order], :conditions => { :rating => filters[:ratings] })
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13') ORDER BY release_date